[{"title": "AI Is Helping Scientists Discover Fresh Craters on Mars", "preview": "It's the first time machine learning has been used to find previously unknown craters on the Red Planet."}, {"title": "NASA Adds Return Sample Scientists to Mars 2020 Leadership Team", "preview": "The leadership council for Mars 2020 science added two new members who represent the interests of scientists destined to handle and study the first samples from Red Planet."}, {"title": "Space History Is Made in This NASA Robot Factory", "preview": "From rockets to rovers, JPL's Spacecraft Assembly Facility has been at the center of robotic spaceflight. Here's a closer look at what makes it so special."}, {"title": "Three New Views of Mars' Moon Phobos", "preview": "Taken with the infrared camera aboard NASA's Odyssey orbiter, they reveal temperature variations on the small moon as it drifts into and out of Mars’ shadow."}, {"title": "Newfound Martian Aurora Actually the Most Common; Sheds Light on Mars' Changing Climate", "preview": "A type of Martian aurora first identified by NASA’s MAVEN spacecraft in 2016 is actually the most common form of aurora occurring on the Red Planet, according to new results from the mission."}, {"title": "NASA's New Mars Rover Will Use X-Rays to Hunt Fossils", "preview": "PIXL, an instrument on the end of the Perseverance rover's arm, will search for chemical fingerprints left by ancient microbes."}, {"title": "MOXIE Could Help Future Rockets Launch Off Mars", "preview": "NASA's Perseverance rover carries a device to convert Martian air into oxygen that, if produced on a larger scale, could be used not just for breathing, but also for fuel."}, {"title": "NASA's Perseverance Rover 100 Days Out", "preview": "Mark your calendars: The agency's latest rover has only about 8,640,000 seconds to go before it touches down on the Red Planet, becoming history's next Mars car."}, {"title": "Two Rovers to Roll on Mars Again: Curiosity and Mars 2020", "preview": "They look like twins. But under the hood, the rover currently exploring the Red Planet and the one launching there this summer have distinct science tools and roles to play."}, {"title": "Mars Scientists Investigate Ancient Life in Australia", "preview": "Teams with NASA's Mars 2020 and ESA's ExoMars practiced hunting for fossilized microbial life in the Australian Outback in preparation for their Red Planet missions. "}, {"title": "NASA's Briefcase-Size MarCO Satellite Picks Up Honors", "preview": "The twin spacecraft, the first of their kind to fly into deep space, earn a Laureate from Aviation Week & Space Technology."}, {"title": "Independent Review Indicates NASA Prepared for Mars Sample Return Campaign", "preview": "NASA released an independent review report Tuesday indicating the agency is well positioned for its Mars Sample Return campaign to bring pristine samples from Mars to Earth for scientific study."}, {"title": "NASA-JPL Names 'Rolling Stones Rock' on Mars", "preview": "NASA's Mars InSight mission honored one of the biggest bands of all time at Pasadena concert."}, {"title": "NASA Readies Perseverance Mars Rover's Earthly Twin ", "preview": "Did you know NASA's next Mars rover has a nearly identical sibling on Earth for testing? Even better, it's about to roll for the first time through a replica Martian landscape."}, {"title": "NASA's Mars 2020 Rover Completes Its First Drive", "preview": "In a 10-plus-hour marathon, the rover steered, turned and drove in 3-foot (1-meter) increments over small ramps."}]